DATAFRAMES

In [2]:
import numpy as np
import pandas as pd

In [ ]:
data = {
    'Name' : ['John','Anaa','Peter','Linda'],
    'Age' : [22,34,54,33],
    'City' : ['Mumbai','VVyv','Varanasi','Washing'],
    'Salary' : [20000,540000,5678,3334444]
}
df = pd.DataFrame(data)
df

    Name  Age      City   Salary
0   John   22    Mumbai    20000
1   Anaa   34      VVyv   540000
2  Peter   54  Varanasi     5678
3  Linda   33   Washing  3334444

SELECTION AND INDEXING OF COLUMNS

In [5]:
df["Name"]

0     John
1     Anaa
2    Peter
3    Linda
Name: Name, dtype: object

In [7]:
df[["Age","City"]]

   Age      City
0   22    Mumbai
1   34      VVyv
2   54  Varanasi
3   33   Washing

CREATING A NEW COLUMN

In [17]:
df["Hobby"]=['cycling','hopping','singing','chess']
df

    Name  Age   Salary    Hobby
0   John   22    20000  cycling
1   Anaa   34   540000  hopping
2  Peter   54     5678  singing
3  Linda   33  3334444    chess

REMOVING A COLUMN

In [34]:
df.drop('Age' , axis=1)

    Name      City   Salary
0   John    Mumbai    20000
1   Anaa      VVyv   540000
2  Peter  Varanasi     5678
3  Linda   Washing  3334444

In [35]:
df

    Name  Age      City   Salary
0   John   22    Mumbai    20000
1   Anaa   34      VVyv   540000
2  Peter   54  Varanasi     5678
3  Linda   33   Washing  3334444

In [32]:
df.drop('Age' , axis=1 , inplace=True)
df

    Name      City   Salary
0   John    Mumbai    20000
1   Anaa      VVyv   540000
2  Peter  Varanasi     5678
3  Linda   Washing  3334444

In [36]:
df.drop(2 , axis=0 , inplace=True)
df

    Name  Age     City   Salary
0   John   22   Mumbai    20000
1   Anaa   34     VVyv   540000
3  Linda   33  Washing  3334444

In [37]:
data = {
    'Name' : ['John','Anaa','Peter','Linda'],
    'Age' : [22,34,54,33],
    'City' : ['Mumbai','VVyv','Varanasi','Washing'],
    'Salary' : [20000,540000,5678,3334444]
}
df = pd.DataFrame(data)
df

    Name  Age      City   Salary
0   John   22    Mumbai    20000
1   Anaa   34      VVyv   540000
2  Peter   54  Varanasi     5678
3  Linda   33   Washing  3334444